       IDENTIFICATION DIVISION.
       PROGRAM-ID. CobCash.

       PROCEDURE DIVISION.
           DISPLAY "This is a WIP program.".
           STOP RUN.
       
       END PROGRAM CobCash.
